-- phpMyAdmin SQL Dump
-- version 4.4.15.9
-- https://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Nov 02, 2019 at 10:09 
-- Server version: 5.6.37
-- PHP Version: 7.1.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `robofood_zakazy`
--

-- --------------------------------------------------------

--
-- Table structure for table `allzakazy`
--

CREATE TABLE IF NOT EXISTS `allzakazy` (
  `id` int(11) NOT NULL,
  `robot` int(11) NOT NULL,
  `totalSum` decimal(6,0) NOT NULL,
  `timeStart` datetime NOT NULL,
  `status` varchar(20) NOT NULL DEFAULT 'started'
) ENGINE=InnoDB AUTO_INCREMENT=118 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `allzakazy`
--

INSERT INTO `allzakazy` (`id`, `robot`, `totalSum`, `timeStart`, `status`) VALUES
(83, 8, '250', '2019-03-17 23:03:27', 'completed'),
(84, 7, '734', '2019-03-17 23:03:01', 'completed'),
(85, 3, '465', '2019-03-17 23:03:01', 'completed'),
(86, 5, '90', '2019-03-17 23:03:44', 'completed'),
(87, 9, '165', '2019-03-18 19:03:45', 'completed'),
(88, 4, '115', '2019-03-19 19:03:46', 'completed'),
(89, 2, '250', '2019-03-19 20:03:55', 'completed'),
(90, 1, '100', '2019-03-19 20:03:37', 'completed'),
(91, 3, '250', '2019-03-19 20:03:49', 'completed'),
(92, 3, '25', '2019-03-19 20:03:30', 'completed'),
(93, 9, '25', '2019-03-19 20:03:17', 'completed'),
(94, 2, '110', '2019-03-19 20:03:56', 'completed'),
(95, 2, '25', '2019-03-19 20:03:57', 'completed'),
(96, 9, '40', '2019-03-19 20:03:09', 'completed'),
(97, 8, '50', '2019-03-19 20:03:10', 'completed'),
(98, 1, '160', '2019-04-10 21:04:50', 'completed'),
(99, 1, '145', '2019-04-10 21:04:32', 'completed'),
(100, 12, '60', '2019-04-10 21:04:19', 'completed'),
(101, 6, '950', '2019-04-10 21:04:45', 'completed'),
(102, 10, '700', '2019-04-10 21:04:49', 'completed'),
(103, 8, '60', '2019-04-10 21:04:38', 'completed'),
(104, 11, '110', '2019-09-11 10:09:27', 'completed'),
(105, 8, '40', '2019-09-11 10:09:41', 'completed'),
(106, 9, '290', '2019-09-11 15:09:32', 'completed'),
(107, 1, '60', '2019-10-09 17:10:00', 'completed'),
(108, 11, '250', '2019-10-09 17:10:36', 'completed'),
(109, 2, '60', '2019-10-09 17:10:29', 'completed'),
(110, 12, '150', '2019-10-09 17:10:06', 'completed'),
(111, 10, '320', '2019-10-09 19:10:53', 'completed'),
(113, 3, '60', '2019-10-28 17:10:23', 'started'),
(114, 2, '1134', '2019-11-01 18:11:49', 'started'),
(115, 2, '968', '2019-11-01 18:11:04', 'started'),
(116, 2, '713', '2019-11-01 18:11:52', 'started'),
(117, 2, '872', '2019-11-02 09:11:47', 'started');

-- --------------------------------------------------------

--
-- Table structure for table `zakazproducts`
--

CREATE TABLE IF NOT EXISTS `zakazproducts` (
  `id` int(11) NOT NULL,
  `zakaz` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `yield` decimal(6,0) NOT NULL,
  `price` decimal(6,0) NOT NULL,
  `count` int(11) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=168 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `zakazproducts`
--

INSERT INTO `zakazproducts` (`id`, `zakaz`, `title`, `yield`, `price`, `count`) VALUES
(90, 83, 'Суп', '0', '250', 1),
(91, 84, 'Бон Аква газ., и н/газ', '0', '40', 1),
(92, 84, 'Блюдо', '0', '444', 1),
(93, 84, 'Суп', '0', '250', 1),
(94, 85, 'Бон Аква газ., и н/газ', '0', '40', 1),
(95, 85, 'Нарзан газ.', '0', '25', 1),
(96, 85, 'штрудель', '0', '50', 8),
(97, 86, 'Бон Аква газ., и н/газ', '0', '40', 1),
(98, 86, 'штрудель', '0', '50', 1),
(99, 87, 'Бон Аква газ., и н/газ', '0', '40', 1),
(100, 87, 'Нарзан газ.', '0', '25', 1),
(101, 87, 'штрудель', '0', '50', 2),
(102, 88, 'Бон Аква газ., и н/газ', '0', '40', 1),
(103, 88, 'Нарзан газ.', '0', '25', 3),
(104, 89, 'штрудель', '0', '50', 1),
(105, 89, 'Кекс', '0', '50', 1),
(106, 89, 'Sup', '0', '150', 1),
(107, 90, 'штрудель', '0', '50', 2),
(108, 91, 'штрудель', '0', '50', 1),
(109, 91, 'Кекс', '0', '50', 1),
(110, 91, 'Sup', '0', '150', 1),
(111, 92, 'Нарзан газ.', '0', '25', 1),
(112, 93, 'Нарзан газ.', '0', '25', 1),
(113, 94, 'чай', '0', '60', 1),
(114, 94, 'Кекс', '0', '50', 1),
(115, 95, 'Нарзан газ.', '0', '25', 1),
(116, 96, 'Бон Аква газ., и н/газ', '0', '40', 1),
(117, 97, 'штрудель', '0', '50', 1),
(118, 98, 'штрудель', '0', '50', 1),
(119, 98, 'Кекс', '0', '50', 1),
(120, 98, 'кофе', '0', '60', 1),
(121, 99, 'Нарзан газ.', '0', '25', 1),
(122, 99, 'чай', '0', '60', 1),
(123, 99, 'кофе', '0', '60', 1),
(124, 100, 'чай', '0', '60', 1),
(125, 101, 'штрудель', '0', '50', 1),
(126, 101, 'Кекс', '0', '50', 1),
(127, 101, 'Sup', '0', '150', 1),
(128, 101, 'Детское', '0', '500', 1),
(129, 101, 'Картофель', '0', '200', 1),
(130, 102, 'Кекс', '0', '50', 1),
(131, 102, 'Sup', '0', '150', 1),
(132, 102, 'Детское', '0', '500', 1),
(133, 103, 'кофе', '0', '60', 1),
(134, 104, 'штрудель', '0', '50', 1),
(135, 104, 'кофе', '0', '60', 1),
(136, 105, 'Бон Аква газ., и н/газ', '0', '40', 1),
(137, 106, '1Беляш откр', '0', '60', 1),
(138, 106, '1Сок яблочный', '0', '80', 1),
(139, 106, '2Пицца', '0', '90', 1),
(140, 106, '4Капкейк', '0', '60', 1),
(141, 107, '1Беляш откр', '0', '60', 1),
(142, 108, '1Сок смородиновый', '0', '80', 1),
(143, 108, '2Морс клюквенный', '0', '80', 1),
(144, 108, '6Кока кола', '0', '90', 1),
(145, 109, '1Беляш откр', '0', '60', 1),
(146, 110, '2Пицца', '0', '90', 1),
(147, 110, '4Капкейк', '0', '60', 1),
(148, 111, '1Сок апельсин', '0', '80', 1),
(149, 111, '1Сок смородиновый', '0', '80', 1),
(150, 111, '1Сок мультифрукт', '0', '80', 1),
(151, 111, '2Морс клюквенный', '0', '80', 1),
(153, 113, '1Беляш откр', '0', '60', 1),
(154, 114, 'Пеперони', '0', '566', 1),
(155, 114, 'с луком', '0', '56', 1),
(156, 114, 'Пицца барбекю', '0', '456', 1),
(157, 114, 'Пицца берега', '0', '56', 1),
(158, 115, 'с луком', '0', '56', 1),
(159, 115, 'Пицца барбекю', '0', '456', 2),
(160, 116, 'с луком', '0', '56', 1),
(161, 116, 'Яблочный', '0', '56', 1),
(162, 116, 'Тыквенный', '0', '56', 1),
(163, 116, 'Суп с индейкой', '0', '545', 1),
(164, 117, 'с луком', '0', '56', 1),
(165, 117, 'Пицца барбекю', '0', '456', 1),
(166, 117, 'Пицца берега', '0', '56', 1),
(167, 117, 'Мультифруктовый', '0', '76', 4);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `allzakazy`
--
ALTER TABLE `allzakazy`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `zakazproducts`
--
ALTER TABLE `zakazproducts`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `allzakazy`
--
ALTER TABLE `allzakazy`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=118;
--
-- AUTO_INCREMENT for table `zakazproducts`
--
ALTER TABLE `zakazproducts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=168;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
